{
    "Amphibious": "The $NAME$ can breathe air and water.",
    "Mucous Cloud": "While underwater, the $NAME$ is surrounded by transformative mucus. A creature that touches the $NAME$ or that hits it with a melee attack while within 5 feet of it must make a DC 14+1d8 + 10 Constitution saving throw. On a failure, the creature is diseased for 1d4 hours. The diseased creature can breathe only underwater.",
    "Probing Telepathy": "If a creature communicates telepathically with the $NAME$, the $NAME$ learns the creature's greatest desires if the $NAME$ can see the creature.",
    "Legendary Resistance (3/Day)": "If the $NAME$ fails a saving throw, it can choose to succeed instead.",
    "Ice Walk": "The $NAME$ can move across and climb icy surfaces without needing to make an ability check. Additionally, difficult terrain composed of ice or snow doesn't cost it extra movement.",
    "Air Form": "The $NAME$ can enter a hostile creature's space and stop there. It can move through a space as narrow as 1 inch wide without squeezing.",
    "Inscrutable": "The $NAME$ is immune to any effect that would sense its emotions or read its thoughts, as well as any divination spell that it refuses. Wisdom (Insight) checks made to ascertain the $NAME$'s intentions or sincerity have disadvantage.",
    "Magic Weapons": "The $NAME$'s weapon attacks are magical.",
    "Antimagic Susceptibility": "The $NAME$ is incapacitated while in the area of an antimagic field. If targeted by dispel magic, the $NAME$ must succeed on a Constitution saving throw against the caster's spell save DC or fall unconscious for 1 minute.",
    "False Appearance": "While the $NAME$ remains motionless, it is indistinguishable from an ordinary fungus.",
    "Magic Resistance": "The $NAME$ has advantage on saving throws against spells and other magical effects.",
    "Assassinate": "During its first turn, the $NAME$ has advantage on attack rolls against any creature that hasn't taken a turn. Any hit the $NAME$ scores against a surprised creature is a critical hit.",
    "Evasion": "If the $NAME$ is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, the $NAME$ instead takes no damage if it succeeds on the saving throw, and only half damage if it fails.",
    "Sneak Attack (1/Turn)": "The $NAME$ deals an extra 7 (2d6) damage when it hits a target with a weapon attack and has advantage on the attack roll, or when the target is within 5 feet of an ally of the $NAME$ that isn't incapacitated and the $NAME$ doesn't have disadvantage on the attack roll.",
    "Incorporeal Movement": "The $NAME$ can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object.",
    "Turn Immunity": "The $NAME$ is immune to features that turn undead.",
    "Heated Weapons": "Any metal melee weapon the $NAME$ wields deals an extra 3 (1d6) fire damage on a hit (included in the attack).",
    "Illumination": "The $NAME$ sheds bright light in a 10-foot radius and dim light for an additional 10 feet.",
    "Pack Tactics": "The $NAME$ has advantage on an attack roll against a creature if at least one of the $NAME$'s allies is within 5 feet of the creature and the ally isn't incapacitated.",
    "Keen Smell": "The $NAME$ has advantage on Wisdom (Perception) checks that rely on smell.",
    "Fire Aura": "At the start of each of the $NAME$'s turns, each creature within 5 feet of it takes 10 (3d6) fire damage, and flammable objects in the aura that aren't being worn or carried ignite. A creature that touches the $NAME$ or hits it with a melee attack while within 5 feet of it takes 10 (3d6) fire damage.",
    "Barbed Hide": "At the start of each of its turns, the $NAME$ deals 5 (1d10) piercing damage to any creature grappling it.",
    "Devil's Sight": "Magical darkness doesn't impede the $NAME$'s darkvision.",
    "Echolocation": "The $NAME$ can't use its blindsight while deafened.",
    "Keen Hearing": "The $NAME$ has advantage on Wisdom (Perception) checks that rely on hearing.",
    "Steadfast": "The $NAME$ can't be frightened while it can see an allied creature within 30 feet of it.",
    "Reckless": "At the start of its turn, the $NAME$ can gain advantage on all melee weapon attack rolls it makes during that turn, but attack rolls against it have advantage until the start of its next turn.",
    "Amorphous": "The $NAME$ can move through a space as narrow as 1 inch wide without squeezing.",
    "Spider Climb": "The $NAME$ can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check.",
    "Keen Hearing and Smell": "The $NAME$ has advantage on Wisdom (Perception) checks that rely on hearing or smell.",
    "Keen Sight": "The $NAME$ has advantage on Wisdom (Perception) checks that rely on sight.",
    "Surprise Attack": "If the $NAME$ surprises a creature and hits it with an attack during the first round of combat, the target takes an extra 10 (3d6) damage from the attack.",
    "Standing Leap": "The $NAME$'s long jump is up to 20 feet and its high jump is up to 10 feet, with or without a running start.",
    "Sense Magic": "The $NAME$ senses magic within 120 feet of it at will. This trait otherwise works like the detect magic spell but isn't itself magical.",
    "Acid Absorption": "Whenever the $NAME$ is subjected to acid damage, it takes no damage and instead regains a number of hit points equal to the acid damage dealt.",
    "Berserk": "Whenever the $NAME$ starts its turn with 40 hit points or fewer, roll a d6. On a 6, the $NAME$ goes berserk. On each of its turns while berserk, the $NAME$ attacks the nearest creature it can see. If no creature is near enough to move to and attack, the $NAME$ attacks an object, with preference for an object smaller than itself. Once the $NAME$ goes berserk, it continues to do so until it is destroyed or regains all its hit points.The $NAME$'s creator, if within 60 feet of the berserk $NAME$, can try to calm it by speaking firmly and persuasively. The $NAME$ must be able to hear its creator, who must take an action to make a DC 15+1d6 + 12 Charisma (Persuasion) check. If the check succeeds, the $NAME$ ceases being berserk. If it takes damage while still at 40 hit points or fewer, the $NAME$ might go berserk again.",
    "Immutable Form": "The $NAME$ is immune to any spell or effect that would alter its form.",
    "Shielded Mind": "The $NAME$ is immune to scrying and to any effect that would sense its emotions, read its thoughts, or detect its location.",
    "Hold Breath": "The $NAME$ can hold its breath for 1 hour.",
    "Dark Devotion": "The $NAME$ has advantage on saving throws against being charmed or frightened.",
    "Two-Headed": "The $NAME$ has advantage on Wisdom (Perception) checks and on saving throws against being blinded, charmed, deafened, frightened, stunned, or knocked unconscious.",
    "Gnome Cunning": "The $NAME$ has advantage on Intelligence, Wisdom, and Charisma saving throws against magic.",
    "Stone Camouflage": "The $NAME$ has advantage on Dexterity (Stealth) checks made to hide in rocky terrain.",
    "Elemental Demise": "If the $NAME$ dies, its body disintegrates in a flash of fire and puff of smoke, leaving behind only equipment the $NAME$ was wearing or carrying.",
    "Shapechanger": "The $NAME$ can use its action to polymorph into a wolf-humanoid hybrid or into a wolf, or back into its true form, which is humanoid. Its statistics, other than its AC, are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if it dies.",
    "Ambusher": "In the first round of a combat, the $NAME$ has advantage on attack rolls against any creature it surprised.",
    "Fetid Cloud (1/Day)": "A 10-foot radius of disgusting green gas extends out from the $NAME$ The gas spreads around corners, and its area is lightly obscured. It lasts for 1 minute or until a strong wind disperses it. Any creature that starts its turn in that area must succeed on a DC 11+1d4 + 9 Constitution saving throw or be poisoned until the start of its next turn. While poisoned in this way, the target can take either an action or a bonus action on its turn, not both, and can't take reactions.",
    "Fey Ancestry": "The $NAME$ has advantage on saving throws against being charmed, and magic can't put the $NAME$ to sleep.",
    "Sunlight Sensitivity": "While in sunlight, the $NAME$ has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight.",
    "Web Walker": "The $NAME$ ignores movement restrictions caused by webbing.",
    "Speak with Beasts and Plants": "The $NAME$ can communicate with beasts and plants as if they shared a language.",
    "Tree Stride": "Once on her turn, the $NAME$ can use 10 feet of her movement to step magically into one living tree within her reach and emerge from a second living tree within 60 feet of the first tree, appearing in an unoccupied space within 5 feet of the second tree. Both trees must be large or bigger.",
    "Duergar Resilience": "The $NAME$ has advantage on saving throws against poison, spells, and illusions, as well as to resist being charmed or paralyzed.",
    "Earth Glide": "The $NAME$ can burrow through nonmagical, unworked earth and stone. While doing so, the $NAME$ doesn't disturb the material it moves through.",
    "Siege Monster": "The $NAME$ deals double damage to objects and structures.",
    "Hellish Weapons": "The $NAME$'s weapon attacks are magical and deal an extra 13 (3d8) poison damage on a hit (included in the attacks).",
    "Web Sense": "While in contact with a web, the $NAME$ knows the exact location of any other creature in contact with the same web.",
    "Two Heads": "The $NAME$ has advantage on Wisdom (Perception) checks and on saving throws against being blinded, charmed, deafened, frightened, stunned, and knocked unconscious.",
    "Wakeful": "While the $NAME$ sleeps, at least one of its heads is awake.",
    "Fire Form": "The $NAME$ can move through a space as narrow as 1 inch wide without squeezing. A creature that touches the $NAME$ or hits it with a melee attack while within 5 feet of it takes 5 (1d10) fire damage. In addition, the $NAME$ can enter a hostile creature's space and stop there. The first time it enters a creature's space on a turn, that creature takes 5 (1d10) fire damage and catches fire; until someone takes an action to douse the fire, the creature takes 5 (1d10) fire damage at the start of each of its turns.",
    "Water Susceptibility": "For every 5 feet the $NAME$ moves in water, or for every gallon of water splashed on it, it takes 1 cold damage.",
    "Aversion of Fire": "If the $NAME$ takes fire damage, it has disadvantage on attack rolls and ability checks until the end of its next turn.",
    "Lightning Absorption": "Whenever the $NAME$ is subjected to lightning damage, it takes no damage and regains a number of hit points equal to the lightning damage dealt.",
    "Flyby": "The $NAME$ doesn't provoke opportunity attacks when it flies out of an enemy's reach.",
    "Ooze Cube": "The $NAME$ takes up its entire space. Other creatures can enter the space, but a creature that does so is subjected to the $NAME$'s Engulf and has disadvantage on the saving throw.Creatures inside the $NAME$ can be seen but have total cover.A creature within 5 feet of the $NAME$ can take an action to pull a creature or object out of the $NAME$. Doing so requires a successful DC 12+1d4 + 10 Strength check, and the creature making the attempt takes 10 (3d6) acid damage.The $NAME$ can hold only one Large creature or up to four Medium or smaller creatures inside it at a time.",
    "Transparent": "Even when the $NAME$ is in plain sight, it takes a successful DC 15+1d4 + 13 Wisdom (Perception) check to spot a $NAME$ that has neither moved nor attacked. A creature that tries to enter the $NAME$'s space while unaware of the $NAME$ is surprised by the $NAME$.",
    "Turn Defiance": "The $NAME$ and any ghouls within 30 feet of it have advantage on saving throws against effects that turn undead.",
    "Ethereal Sight": "The $NAME$ can see 60 feet into the Ethereal Plane when it is on the Material Plane, and vice versa.",
    "Sure-Footed": "The $NAME$ has advantage on Strength and Dexterity saving throws made against effects that would knock it prone.",
    "Rampage": "When the $NAME$ reduces a creature to 0 hit points with a melee attack on its turn, the $NAME$ can take a bonus action to move up to half its speed and make a bite attack.",
    "Underwater Camouflage": "The $NAME$ has advantage on Dexterity (Stealth) checks made while underwater.",
    "Water Breathing": "The $NAME$ can breathe only underwater.",
    "Keen Hearing and Sight": "The $NAME$ has advantage on Wisdom (Perception) checks that rely on hearing or sight.",
    "Blood Frenzy": "The $NAME$ has advantage on melee attack rolls against any creature that doesn't have all its hit points.",
    "Keen Sight and Smell": "The $NAME$ has advantage on Wisdom (Perception) checks that rely on sight or smell.",
    "Aberrant Ground": "The ground in a 10-foot radius around the $NAME$ is doughlike difficult terrain. Each creature that starts its turn in that area must succeed on a DC 10+1d4 + 8 Strength saving throw or have its speed reduced to 0 until the start of its next turn.",
    "Gibbering": "The $NAME$ babbles incoherently while it can see any creature and isn't incapacitated. Each creature that starts its turn within 20 feet of the $NAME$ and can hear the gibbering must succeed on a DC 10+1d4 + 8 Wisdom saving throw. On a failure, the creature can't take reactions until the start of its next turn and rolls a d8 to determine what it does during its turn. On a 1 to 4, the creature does nothing. On a 5 or 6, the creature takes no action or bonus action and uses all its movement to move in a randomly determined direction. On a 7 or 8, the creature makes a melee attack against a randomly determined creature within its reach or does nothing if it can't make such an attack.",
    "Brave": "The $NAME$ has advantage on saving throws against being frightened.",
    "Nimble Escape": "The $NAME$ can take the Disengage or Hide action as a bonus action on each of its turns.",
    "Corrode Metal": "Any nonmagical weapon made of metal that hits the $NAME$ corrodes. After dealing damage, the weapon takes a permanent and cumulative −1 penalty to damage rolls. If its penalty drops to −5, the weapon is destroyed. Nonmagical ammunition made of metal that hits the $NAME$ is destroyed after dealing damage.The $NAME$ can eat through 2-inch-thick, nonmagical metal in 1 round.",
    "Mimicry": "The $NAME$ can mimic simple sounds it has heard, such as a person whispering, a baby crying, or an animal chittering. A creature that hears the sounds can tell they are imitations with a successful DC 10+1d4 + 8 Wisdom (Insight) check.",
    "Blind Senses": "The $NAME$ can't use its blindsight while deafened and unable to smell.",
    "Rejuvenation": "If it dies, the $NAME$ returns to life in 1d6 days and regains all its hit points. Only a wish spell can prevent this trait from functioning.",
    "Luring Song": "The $NAME$ sings a magical melody. Every humanoid and giant within 300 feet of the $NAME$ that can hear the song must succeed on a DC 11+1d4 + 9 Wisdom saving throw or be charmed until the song ends. The $NAME$ must take a bonus action on its subsequent turns to continue singing. It can stop singing at any time. The song ends if the $NAME$ is incapacitated.While charmed by the $NAME$, a target is incapacitated and ignores the songs of other harpies. If the charmed target is more than 5 feet away from the $NAME$, the target must move on its turn toward the $NAME$ by the most direct route. It doesn't avoid opportunity attacks, but before moving into damaging terrain, such as lava or a pit, and whenever it takes damage from a source other than the $NAME$, a target can repeat the saving throw. A creature can also repeat the saving throw at the end of each of its turns. If a creature's saving throw is successful, the effect ends on it.A target that successfully saves is immune to this $NAME$'s song for the next 24 hours.",
    "Martial Advantage": "Once per turn, the $NAME$ can deal an extra 7 (2d6) damage to a creature it hits with a weapon attack if that creature is within 5 feet of an ally of the $NAME$ that isn't incapacitated.",
    "Telepathic Bond": "The $NAME$ ignores the range restriction on its telepathy when communicating with a creature it has charmed. The two don't even need to be on the same plane of existence.",
    "Multiple Heads": "The $NAME$ has five heads. While it has more than one head, the $NAME$ has advantage on saving throws against being blinded, charmed, deafened, frightened, stunned, and knocked unconscious.Whenever the $NAME$ takes 25 or more damage in a single turn, one of its heads dies. If all its heads die, the $NAME$ dies.At the end of its turn, it grows two heads for each of its heads that died since its last turn, unless it has taken fire damage since its last turn. The $NAME$ regains 10 hit points for each head regrown in this way.",
    "Reactive Heads": "For each head the $NAME$ has beyond one, it gets an extra reaction that can be used only for opportunity attacks.",
    "Faultless Tracker": "The $NAME$ is given a quarry by its summoner. The $NAME$ knows the direction and distance to its quarry as long as the two of them are on the same plane of existence. The $NAME$ also knows the location of its summoner.",
    "Invisibility": "The $NAME$ magically turns invisible until it attacks or casts a spell, or until its concentration ends (as if concentrating on a spell). Any equipment the $NAME$ wears or carries is invisible with it.",
    "Fire Absorption": "Whenever the $NAME$ is subjected to fire damage, it takes no damage and instead regains a number of hit points equal to the fire damage dealt.",
    "Freedom of Movement": "The $NAME$ ignores difficult terrain, and magical effects can't reduce its speed or cause it to be restrained. It can spend 5 feet of movement to escape from nonmagical restraints or being grappled.",
    "Hellish Rejuvenation": "A $NAME$ that dies in the Nine Hells comes back to life with all its hit points in 1d10 days unless it is killed by a good-aligned creature with a bless spell cast on that creature or its remains are sprinkled with holy water.",
    "Turn Resistance": "The $NAME$ has advantage on saving throws against any effect that turns undead.",
    "Running Leap": "With a 10-foot running start, the $NAME$ can long jump up to 25 feet.",
    "Ignited Illumination": "As a bonus action, the $NAME$ can set itself ablaze or extinguish its flames. While ablaze, the $NAME$ sheds bright light in a 10-foot radius and dim light for an additional 10 feet.",
    "Tail Spike Regrowth": "The $NAME$ has twenty-four tail spikes. Used spikes regrow when the $NAME$ finishes a long rest.",
    "Reactive": "The $NAME$ can take one reaction on every turn in combat.",
    "Grappler": "The $NAME$ has advantage on attack rolls against any creature grappled by it.",
    "Adhesive (Object Form Only)": "The $NAME$ adheres to anything that touches it. A Huge or smaller creature adhered to the $NAME$ is also grappled by it (escape DC 13+1d4 + 11). Ability checks made to escape this grapple have disadvantage.",
    "False Appearance (Object Form Only)": "While the $NAME$ remains motionless, it is indistinguishable from an ordinary object.",
    "Labyrinthine Recall": "The $NAME$ can perfectly recall any path it has traveled.",
    "Beast of Burden": "The $NAME$ is considered to be a Large animal for the purpose of determining its carrying capacity.",
    "Night Hag Items": "A $NAME$ carries two very rare magic items that she must craft for herself. If either object is lost, the $NAME$ will go to great lengths to retrieve it, as creating a new tool takes time and effort.Heartstone: This lustrous black gem allows a $NAME$ to become ethereal while it is in her possession. The touch of a heartstone also cures any disease. Crafting a heartstone takes 30 days.Soul Bag: When an evil humanoid dies as a result of a $NAME$'s Nightmare Haunting, the hag catches the soul in this black sack made of stitched flesh. A soul bag can hold only one evil soul at a time, and only the $NAME$ who crafted the bag can catch a soul with it. Crafting a soul bag takes 7 days and a humanoid sacrifice (whose flesh is used to make the bag).",
    "Confer Fire Resistance": "The $NAME$ can grant resistance to fire damage to anyone riding it.",
    "Undead Fortitude": "If damage reduces the $NAME$ to 0 hit points, it must make a Constitution saving throw with a DC of 5 + the damage taken, unless the damage is radiant or from a critical hit. On a success, the $NAME$ drops to 1 hit point instead.",
    "Aggressive": "As a bonus action, the $NAME$ can move up to its speed toward a hostile creature that it can see.",
    "Limited Telepathy": "The $NAME$ can magically communicate simple ideas, emotions, and images telepathically with any creature within 100 feet of it that can understand a language.",
    "Ethereal Jaunt": "As a bonus action, the $NAME$ can magically shift from the Material Plane to the Ethereal Plane, or vice versa.",
    "Divine Awareness": "The $NAME$ knows if it hears a lie.",
    "Divine Eminence": "As a bonus action, the $NAME$ can expend a spell slot to cause its melee weapon attacks to magically deal an extra 10 (3d6) radiant damage to a target on a hit. This benefit lasts until the end of the turn. If the $NAME$ expends a spell slot of 2nd level or higher, the extra damage increases by 1d6 for each level above 1st.",
    "Keen Senses": "The $NAME$ has advantage on Wisdom (Perception) checks that rely on sight, hearing, or smell.",
    "Tunneler": "The $NAME$ can burrow through solid rock at half its burrow speed and leaves a 10-foot-diameter tunnel in its wake.",
    "Limited Magic Immunity": "The $NAME$ can't be affected or detected by spells of 6th level or lower unless it wishes to be. It has advantage on saving throws against all other spells and magical effects.",
    "Grasping Tendrils": "The $NAME$ can have up to six tendrils at a time. Each tendril can be attacked (AC 20; 10 hit points; immunity to poison and psychic damage). Destroying a tendril deals no damage to the $NAME$, which can extrude a replacement tendril on its next turn. A tendril can also be broken if a creature takes an action and succeeds on a DC 15+1d6 + 12 Strength check against it.",
    "Damage Transfer": "While it is grappling a creature, the $NAME$ takes only half the damage dealt to it, and the creature grappled by the $NAME$ takes the other half.",
    "Iron Scent": "The $NAME$ can pinpoint, by scent, the location of ferrous metal within 30 feet of it.",
    "Rust Metal": "Any nonmagical weapon made of metal that hits the $NAME$ corrodes. After dealing damage, the weapon takes a permanent and cumulative −1 penalty to damage rolls. If its penalty drops to −5, the weapon is destroyed. Non magical ammunition made of metal that hits the $NAME$ is destroyed after dealing damage.",
    "Limited Amphibiousness": "The $NAME$ can breathe air and water, but it needs to be submerged at least once every 4 hours to avoid suffocating.",
    "Shark Telepathy": "The $NAME$ can magically command any shark within 120 feet of it, using a limited telepathy.",
    "Horrific Appearance": "Any humanoid that starts its turn within 30 feet of the $NAME$ and can see the $NAME$'s true form must make a DC 11+1d4 + 9 Wisdom saving throw. On a failed save, the creature is frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, with disadvantage if the $NAME$ is within line of sight, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the $NAME$'s Horrific Appearance for the next 24 hours.Unless the target is surprised or the revelation of the $NAME$'s true form is sudden, the target can avert its eyes and avoid making the initial saving throw. Until the start of its next turn, a creature that averts its eyes has disadvantage on attack rolls against the $NAME$.",
    "Shadow Stealth": "While in dim light or darkness, the $NAME$ can take the Hide action as a bonus action. Its stealth bonus is also improved to +6.",
    "Sunlight Weakness": "While in sunlight, the $NAME$ has disadvantage on attack rolls, ability checks, and saving throws.",
    "Bound": "The $NAME$ is magically bound to an amulet. As long as the guardian and its amulet are on the same plane of existence, the amulet's wearer can telepathically call the guardian to travel to it, and the guardian knows the distance and direction to the amulet. If the guardian is within 60 feet of the amulet's wearer, half of any damage the wearer takes (rounded up) is transferred to the guardian.",
    "Spell Storing": "A spellcaster who wears the $NAME$ can cause the guardian to store one spell of 4th level or lower. To do so, the wearer must cast the spell on the guardian. The spell has no effect but is stored within the guardian. When commanded to do so by the wearer or when a situation arises that was predefined by the spellcaster, the guardian casts the stored spell with any parameters set by the original caster, requiring no components. When the spell is cast or a new spell is stored, any previously stored spell is lost.",
    "Heart Sight": "The $NAME$ touches a creature and magically knows the creature's current emotional state. If the target fails a DC 10+1d4 + 8 Charisma saving throw, the $NAME$ also knows the creature's alignment. Celestials, fiends, and undead automatically fail the saving throw.",
    "Cunning Action": "On each of its turns, the $NAME$ can use a bonus action to take the Dash, Disengage, or Hide action.",
    "Swarm": "The $NAME$ can occupy another creature's space and vice versa, and the $NAME$ can move through any opening large enough for a Tiny insect. The $NAME$ can't regain hit points or gain temporary hit points.",
    "Reflective Carapace": "Any time the $NAME$ is targeted by a magic missile spell, a line spell, or a spell that requires a ranged attack roll, roll a d6. On a 1 to 5, the $NAME$ is unaffected. On a 6, the $NAME$ is unaffected, and the effect is reflected back at the caster as though it originated from the $NAME$, turning the caster into the target.",
    "Misty Escape": "When it drops to 0 hit points outside its resting place, the $NAME$ transforms into a cloud of mist (as in the Shapechanger trait) instead of falling unconscious, provided that it isn't in sunlight or running water. If it can't transform, it is destroyed.While it has 0 hit points in mist form, it can't revert to its $NAME$ form, and it must reach its resting place within 2 hours or be destroyed. Once in its resting place, it reverts to its $NAME$ form. It is then paralyzed until it regains at least 1 hit point. After spending 1 hour in its resting place with 0 hit points, it regains 1 hit point.",
    "Vampire Weaknesses": "The $NAME$ has the following flaws:Forbiddance. The $NAME$ can't enter a residence without an invitation from one of the occupants.Harmed by Running Water. The $NAME$ takes 20 acid damage when it ends its turn in running water.Stake to the Heart. The $NAME$ is destroyed if a piercing weapon made of wood is driven into its heart while it is incapacitated in its resting place.Sunlight Hypersensitivity. The $NAME$ takes 20 radiant damage when it starts its turn in sunlight. While in sunlight, it has disadvantage on attack rolls and ability checks.",
    "Freeze": "If the $NAME$ takes cold damage, it partially freezes; its speed is reduced by 20 feet until the end of its next turn.",
    "Water Form": "The $NAME$ can enter a hostile creature's space and stop there. It can move through a space as narrow as 1 inch wide without squeezing.",
    "Ephemeral": "The $NAME$ can't wear or carry anything.",
    "Variable Illumination": "The $NAME$ sheds bright light in a 5 to 20-foot radius and dim light for an additional number of ft. equal to the chosen radius. The $NAME$ can alter the radius as a bonus action.",
    "Snow Camouflage": "The $NAME$ has advantage on Dexterity (Stealth) checks made to hide in snowy terrain.",
    "Treasure Sense": "The $NAME$ can pinpoint, by scent, the location of precious metals and stones, such as coins and gems, within 60 feet of it."
}